In [36]:
import pandas as pd 
import numpy as np

In [5]:
df=pd.DataFrame.from_dict({'a':[1,2],'b':[3,4]})
df

   a  b
0  1  3
1  2  4

In [9]:
df.columns

Index(['a', 'b'], dtype='object')

In [10]:
df.shape

(2, 2)

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       2 non-null      int64
 1   b       2 non-null      int64
dtypes: int64(2)
memory usage: 164.0 bytes

In [12]:
df.dtypes

a    int64
b    int64
dtype: object

In [16]:
dd = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve',
             'Frank', 'Grace', 'Hannah', 'Ivan', 'Jack',
             'Kathy', 'Liam', 'Mona', 'Nina', 'Oscar', 'Paul'],
    'age': [25, 30, 22, 35, 28,
            40, 23, 31, 29, 34,
            27, 26, 32, 24, 33, 38]
})
result = dd.loc[[5, 10, 15], ['name', 'age']]
result

     name  age
5   Frank   40
10  Kathy   27
15   Paul   38

In [ ]:
dd[dd['age']>10]

       name  age
0     Alice   25
1       Bob   30
2   Charlie   22
3     David   35
4       Eve   28
5     Frank   40
6     Grace   23
7    Hannah   31
8      Ivan   29
9      Jack   34
10    Kathy   27
11     Liam   26
12     Mona   32
13     Nina   24
14    Oscar   33
15     Paul   38

In [20]:
dd['age'].notna()

0     True
1     True
2     True
3     True
4     True
5     True
6     True
7     True
8     True
9     True
10    True
11    True
12    True
13    True
14    True
15    True
Name: age, dtype: bool

In [21]:
dd[dd['age'].isin([25,30,40])]

    name  age
0  Alice   25
1    Bob   30
5  Frank   40

In [ ]:
df2 = pd.DataFrame({
    'name': ['Quinn', 'Rachel'],
    'age': [29, 31]
})

result1 = pd.concat([dd, df2], ignore_index=True)
result1

       name  age
0     Alice   25
1       Bob   30
2   Charlie   22
3     David   35
4       Eve   28
5     Frank   40
6     Grace   23
7    Hannah   31
8      Ivan   29
9      Jack   34
10    Kathy   27
11     Liam   26
12     Mona   32
13     Nina   24
14    Oscar   33
15     Paul   38
16    Quinn   29
17   Rachel   31

In [31]:
d1 = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve',
             'Frank', 'Grace', 'Hannah', 'Ivan', 'Jack',
             'Kathy', 'Liam', 'Mona', 'Nina', 'Oscar', 'Paul'],
    'age': [25, 30, 22, 35, 28,
            40, 23, 31, 29, 34,
            27, 26, 32, 24, 33, 38],
    'city': ['NY', 'LA', 'NY', 'LA', 'NY',
             'LA', 'NY', 'LA', 'NY', 'LA',
             'NY', 'LA', 'NY', 'LA', 'NY', 'LA']
})

# Выбираем только строки с определенными именами
sub = d1[d1['name'].isin(['Frank', 'Kathy', 'Paul', 'Alice'])]

# Группируем по городу и считаем средний возраст
resul = sub.groupby('city')['age'].agg(['mean', 'max', 'min']).reset_index()
resul

  city  mean  max  min
0   LA  39.0   40   38
1   NY  26.0   27   25

In [34]:
students = pd.DataFrame({
    'student_id': [100, 101, 102, 103, 101],
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'age': [20, 21, 19, 22, 21],
    'grade': ['A', 'B', 'A', 'C', 'B']  # Дополнительная колонка
})

# Фильтрация по student_id == 101 и оставляем только name и age
students = students[students['student_id'] == 101]
students = students[['name', 'age']]
students

  name  age
1  Bob   21
4  Eve   21

In [37]:
products = pd.DataFrame({
    'product': ['Apple', 'Banana', 'Cherry', 'Date'],
    'quantity': [10, np.nan, 5, np.nan]
})
products['quantity'] = products['quantity'].where(products['quantity'].notna(), 0)
products

  product  quantity
0   Apple      10.0
1  Banana       0.0
2  Cherry       5.0
3    Date       0.0

In [38]:
weather = pd.DataFrame({
    'month': ['Jan', 'Jan', 'Feb', 'Feb', 'Mar', 'Mar'],
    'city': ['NY', 'LA', 'NY', 'LA', 'NY', 'LA'],
    'temperature': [30, 60, 32, 62, 45, 65]
})

dg = weather.pivot(index='month', columns='city', values='temperature')
dg

city   LA  NY
month
Feb    62  32
Jan    60  30
Mar    65  45

In [39]:
weather

  month city  temperature
0   Jan   NY           30
1   Jan   LA           60
2   Feb   NY           32
3   Feb   LA           62
4   Mar   NY           45
5   Mar   LA           65

In [40]:
report = pd.DataFrame({
    'product': ['A', 'B', 'C'],
    'Q1': [100, 150, 200],
    'Q2': [110, 160, 210],
    'Q3': [120, 170, 220],
    'Q4': [130, 180, 230]
})

long_report = pd.melt(report, id_vars='product', var_name='quarter', value_name='sales')
long_report

   product quarter  sales
0        A      Q1    100
1        B      Q1    150
2        C      Q1    200
3        A      Q2    110
4        B      Q2    160
5        C      Q2    210
6        A      Q3    120
7        B      Q3    170
8        C      Q3    220
9        A      Q4    130
10       B      Q4    180
11       C      Q4    230

In [41]:
report

  product   Q1   Q2   Q3   Q4
0       A  100  110  120  130
1       B  150  160  170  180
2       C  200  210  220  230